Revit 2024 API
CableTrayConduitRunBase.Length Property
 The length of the whole (cable tray or conduit) run default 0.0
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Length { get; }
Visual Basic
Public ReadOnly Property Length As Double
	Get
Visual C++
public:
property double Length {
	double get ();
}
See Also
CableTrayConduitRunBase Class
Autodesk.Revit.DB.Electrical Namespace